// 보그 PJ 공통 기능 JS - common.js

////// 제이쿼리 블록 ////////////////////
$(()=>{

    // 호출확인
    console.log("로딩완료");

    /****************************************************** 
        페이지 스크롤시 변경 구현하기
        - 이벤트: scroll
        - 제이쿼리 메서드 : scroll()
        - 대상: window
    ******************************************************/
   let scTop; // 스크롤위치변수
   $(window).scroll(function(){
        
        scTop = $(this).scrollTop();
        // scrollTop() -> 세로스크롤바 위치값
        // 참고) 가로스크롤바 위치값은 scrollLeft()

        // 스크롤확인+위치값
        console.log(scTop)
   }); //////////////// scroll ///////////////////////////

}); ///////////////// jQB ////////////////////////////